CREATE DATABASE my_database;

CREATE TABLE Sofia_region (
 animals VARCHAR(50),
 animals_info VARCHAR(1500),
 plants VARCHAR(50),
 plants_info VARCHAR(1500)
);

INSERT INTO Sofia_region(animals,animals_info,plants,plants_info)
VALUES("видра","Разпространение и численост в България: Среща се в равнините, по морското крайбрежие и в планините – до 600 m най - често. Численост (без малките) около 1300–1500 индивида, към 2007 г. Най-плътна е популацията в Югоизточна България.
Местообитания: Естествени речни течения и затворени водоеми с дължина поне 15–20 km: със старици и изобилна крайбрежна растителност – лонгози, елшаци и тръстики (ниски брегове), разнообразна рибна фауна и минимум маса от 40 kg/hа, изобилие от раци, жаби, гръбначни, мекотели.
Отрицателно действащи фактори: Диги и корекции на реки, замърсяване на водите, намаляване на рибата, пресушаване на блата, изсичане на дървесна и храстова крайбрежна растителност. Водно строителство, баластриери, бракониерство, инциденти с МПС, улавяне в рибарски мрежи, жертва на скитащи кучета, безпокойство, летно-есенни пресъхвания на реки.
Необходими мерки за опазване: Обявяване на речни мрежи в равнините и в Родопите за защитени територии и зони. Възстановяване на крайбрежната растителност. Осигуряване на проходи през пътищата. Мониторинг на вида. Зарибяване. Ограждане на рибарници. Популяризиране на ролята на вида в екосистемите. Компенсиране на щетите от видрата.","смрика");

INSERT INTO Sofia_region(animals,animals_info,plants,plants_info)
VALUES("вълк","Разпространение и численост в България: През 1996–1999 г. – поне 1000 индивида. Сега намаляват, численост 700–800 индивида. През размножителния период обитава планините, частично Североизточна България. Есента и до средата на зимата слиза и в равнините.
Местообитания: Предпочита трудно достъпни планински райони с гори, храсталаци, скали, ждрела, ливади.
Отрицателно действащи фактори: Целогодишен лов (убивани до 500 индивида/г. – 1996–1999 г. и около 300 животни – 2001-2004 г.)., намаляване на хранителната база, конкуренция и хибридизация със скитащи кучета.
Необходими мерки за опазване: Ограничаване на лова на вълци през пролетта и лятото. Осигуряване на проходи през магистралите. Мониторинг. Национална и балканска стратегия за опазване. Популяризиране на ролята на вълка в екосистемите. Компенсиране на щетите в животновъдството.","смърч","Смърча е род иглолистни дървета от семейство Борови, включващ около 35 вида. В България се среща по северните склонове на планините, тъй като изисква постоянна влажност на почвата и въздуха.
Смърчът е право и стройно дърво. Стъблото му е високо до 95 m и дебело до 4 m.
Смърчът цъфти през май—юни. Шишарките му са увиснали надолу и узряват през октомври.
Смърчовите гори се намират на надморска височина от 1200 до 2100 m.
Част от смърчовите гори попадат в границите на защитени територии: национални паркове “Рила“, “Пирин“ и “Централен Балкан“, природни паркове “Витоша“ и “Рилски манастир“ и др.
Част от смърчовите гори (основно попадащите в защитени територии) са проучени във флористично, синтаксономично и фаунистично отношение. В част от смърчовите гори се прилагат изборни лесовъдски системи за управление и стопанисване. Някои смърчови гори попадат в международно сертифицирани горскостопански единици.");

INSERT INTO Sofia_region(animals,animals_info,plants,plants_info)
VALUES("дива коза","обикновена пръчковка");

INSERT INTO Sofia_region(animals,animals_info,plants,plants_info)
VALUES("лалугер","Имануелова метличина");

INSERT INTO Sofia_region(animals,animals_info,plants,plants_info)
VALUES("Горчивка","Карпатска тоция");



